Cleanup Contributors Guide, remove Other section
